<svelte:head>
	<title>About</title>
</svelte:head>

<h1>วิธีเล่น</h1>

<p>หาคำใบ้ในแผนที่ gather.town ในงาน Thailand Board Game Show 2021 และนำคำตอบมาใส่ในนี้</p>

<h2>กติกา</h2>
<ol>
	<li>คำตอบเป็นภาษาอังกฤษ (A-Z) โดยจะพิมพ์ตอบด้วยตัวใหญ่หรือเล็กก็ได้</li>
	<li>ใช้ข้อมูลจาก gather.town และจากตารางตัวอักษร 5x5 เท่านั้น</li>
	<li>ลูกเล่นในการกดเลือกตัวอักษรมีไว้ช่วยทดเท่านั้น ไม่ได้เป็นส่วนหนึ่งของปริศนา</li>
	<li>ไม่ต้องค้น script หรือกดปุ่มเป็นลำดับเพื่อแก้ปริศนา</li>
</ol>

<h2>รางวัล</h2>
<ol>
	<li>เมื่อเล่นเสร็จแล้ว จะสามารถใส่ชื่อเพื่อจัดอันดับ ์โดยให้ใช้ชื่อเดียวกันกับชื่อใน gather.town</li>
	<li>ผู้เล่นทุกคนที่แก้ปริศนาได้ภายใน 26 พฤศจิกายน 23:59 น. จะได้รับของที่ระลึกจัดส่งให้หลังงาน</li>
	<li>ทีมงานขอสงวนสิทธิ์ในการเปลี่ยนของรางวัล</li>
</ol>