<script>
</script>

<h2>รางวัล</h2>
<ol>
	<li>เมื่อเล่นเสร็จแล้ว จะสามารถใส่ชื่อเพื่อจัดอันดับ โดยให้ใช้ชื่อเดียวกันกับชื่อในงาน Thailand Board Game Show 2021</li>
	<li>ผู้เล่นทุกคนที่แก้ปริศนาได้ภายในวันอาทิตย์ที่ 28 พฤศจิกายน 19:00 น. จะได้รับของที่ระลึกจัดส่งให้หลังงาน</li>
</ol>s

<h2>การเก็บข้อมูล</h2>
<ol>
	<li>email จะไม่ถูกเผยแพร่สาธารณะ โดยจะถูกนำไปใช้ตรวจสอบการสมัครเพื่อส่งของที่ระลึกให้เท่านั้น</li>
	<li>ข้อมูลทั้งหมด (email, user, คำตอบที่ตอบแล้ว) จะถูกเก็บในอุปกรณ์ที่ใช้ ถ้าเปลี่ยนอุปกรณ์จะต้องกรอกข้อมูลใหม่</li>
</ol>