<script lang="ts">
	import Card, {Content, Actions} from '@smui/card';
	import ClueTable from '../../components/ClueTable.svelte';
	import Button, { Label } from '@smui/button';
	import Drawer, {AppContent, Content, Header, Title} from '@smui/drawer';
	import List, { Item, Text, Graphic } from '@smui/list';

	let activePuzzle = -1
	let activeSection = 0
	const iconurls = [0,1,2,3,4,5].map(x => `./round1/puzzleicon${x+1}.png`)

	const sectionTitles = ['วิธีหาข้อมูล', 'วิธีแก้ปริศนา', 'วิธีอ่านคำตอบ']

	var puzzleTitles = [0,1,2,3,4].map(x => `ปริศนาข้อที่ ${x+1}`)
	puzzleTitles = [... puzzleTitles, `ปริศนาข้อสุดท้าย`]
	const puzzles = [
		[
			'หากลุ่มปลาที่ซ่อนอยู่ในทะเล ทั้งหมด 5 กลุ่ม แต่ละกลุ่มจะมี 1 ช่องที่มีทั้งปลาทั้งไฟ',
			'นำกลุ่มปลาทั้ง 5 กลุ่ม มาวางในตารางขนาด 5x5 ให้ทับทุกช่อง (เหมือน Tetris) โดยไม่ซ้อนทับกัน และไม่ต้องหมุน',
			'อ่านตัวอักษรที่ตำแหน่งตรงกับไฟ จะได้ตัวอักษร 5 ตัว เรียงจากบนลงล่าง'
		],
		[
			'หาช่องลับที่ซ่อนบนแผนที่ ที่เมื่อเดินไปเหยียบแล้วจะมีตัวเลข 0,1,2 และตัว 💣? โผล่ขี้นมา',
			'นำตัวเลขมาใส่ในตารางขนาด 5x5 จะได้ตารางเกม Minesweeper โดยให้หาว่าระเบิด 5 ลูกนั้น ซ่อนอยู่ในช่อง ? ช่องไหน',
			'อ่านตำแหน่งระเบิด จะได้ตัวอักษร 5 ตัว เรียงจากซ้ายไปขวา'
		],
		[
			'หากลุ่มใบเฟิร์น 5 กลุ่ม แต่ละกลุ่มจะมีใบเฟิร์นหลายช่องวางเรียงกัน',
			'แต่ละกลุ่ม จะมีช่องนึงที่ยืนทับแล้วมีอีโมจิขึ้นมา ให้หาว่าแทนความหมายอะไรในภาษาอังกฤษ (เช่น ❤️=HEART) และหาว่าอยู่ส่วนใดของตาราง',
			'อ่านตำแหน่งในช่องที่มีอีโมจิ จะได้ตัวอักษร 5 ตัว อ่านเรียงจากซ้ายไปขวา จะได้คำตอบสุดท้าย'
		],
		[
			'หาวิทยุ 5 ตัว',
			'เมื่อยืนใกล้วิทยุ จะได้คำใบ้ (ตัวอย่าง "แถวที่ 1: มีชู้ = #") โดย # หมายถึงตัวเลข',
			'อ่านตัวอักษรในแถวที่ระบุ และตำแหน่งที่ตรงกับตัวเลข จะได้ตัวอักษร 5 ตัว เรียงบนลงล่าง จะได้คำตอบสุดท้าย'
		],
		[
			'หาดาบทั้งหมด 5 คู่ ที่แต่ละคู่จะชี้เข้าหากัน',
			'มองว่าดาบอยู่ขอบตาราง 5x5 ดาบจะบอกพิกัดของตัวอักษรในตาราง 5x5',
			'อ่านตัวอักษรในพิกัดทั้ง 5 ช่อง จะได้ตัวอักษร 5 ตัว อ่านเรียงบนลงล่าง'
		],
		[
			'นำคำตอบที่ได้จากข้อ 1-5 มาอ่านเรียงกัน จะได้เป็นคำสั่ง',
			'ความหมายคือ "ดูใต้ช่องที่ถูกใช้สองครั้ง" โดยให้ดูว่าคำตอบในข้อ 1-5 ใช้ช่องไหนไปบ้าง',
			'อ่านตัวอักษรตามคำสั่ง จะได้ 5 ตัว เรียงจากซ้ายไปขวา จะได้คำตอบสุดท้าย'
		],
	]

	function setActive(act: number){
		activePuzzle = act
		activeSection = 0
	}
</script>

<div class = 'main'>
	<ClueTable/>
	<div class="drawer-container">
		<Drawer>
		  <Header>
			 <Title>เลือกปริศนา</Title>
		  </Header>
		  <Content>
			 <List>
				{#each Array(6) as _unused, id}
				<Item
				  href="javascript:void(0)"
				  on:click={() => setActive(id)}
				  activated={activePuzzle === id}
				>
					<Graphic style={`background-image: url(${iconurls[id]})`}/>
					<Text>{puzzleTitles[id]}</Text>
				</Item>
				{/each}
			 </List>
		  </Content>
		</Drawer>
	  
		<AppContent class="app-content">
		  <main class="main-content">
			{#if activePuzzle >= 0}
				<div class="card-display" style='width:100%'>
					<div class="card-container">
						<Card>
							{#each sectionTitles as title, i}
								{#if activeSection >= i}
								<Actions fullBleed>
									<Button on:click={() => activeSection+=(activeSection <= i?1: 0)}>
										<Label><h2>{title}</h2></Label>
										<i class="material-icons" aria-hidden="true">expand_more</i>
									</Button>
								</Actions>
								{/if}
								{#if activeSection > i}
								<Content>{@html puzzles[activePuzzle][i]}</Content>
								{/if}
							{/each}
						</Card>
					</div>
				</div>
			{/if}
		  </main>
		</AppContent>
	</div>
</div>

<style>
	.drawer-container {
	  position: relative;
	  display: flex;
	  height: 400px;
	  border: 1px solid
		 var(--mdc-theme-text-hint-on-background, rgba(0, 0, 0, 0.1));
	  overflow: hidden;
	  z-index: 0;
	}

	.main-content {
    overflow: auto;
    padding: 10px;
    height: 100%;
	 width: clamp(300px, 600px, 600px);
    box-sizing: border-box;
  }
</style>